tutorials/compressible/steadyCompressibleMRFFoam/simpleRotorStator/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           BiCGStab;
        preconditioner   ILUC0;

        minIter          0;
        maxIter          1000;
        tolerance        1e-7;
        relTol           0.001;
    }
    U
    {
        solver           BiCGStab;
        preconditioner   ILUC0;

        minIter          0;
        maxIter          100;
        tolerance        1e-7;
        relTol           0.0;
    }
    i
    {
        solver           BiCGStab;
        preconditioner   ILUC0;

        minIter          0;
        maxIter          100;
        tolerance        1e-7;
        relTol           0.0;
    }
    k
    {
        solver           BiCGStab;
        preconditioner   ILUC0;

        minIter          0;
        maxIter          100;
        tolerance        1e-7;
        relTol           0.0;
    }
    epsilon
    {
        solver           BiCGStab;
        preconditioner   ILUC0;

        minIter          0;
        maxIter          100;
        tolerance        1e-7;
        relTol           0.0;
    }
}

PIMPLE
{
    nOuterCorrectors         1;
    nCorrectors              2;
    nNonOrthogonalCorrectors 0;
}

relaxationFactors
{
    equations
    {
        U               0.5;
        i               0.5;
        k               0.5;
        epsilon         0.5;
    }
    fields
    {
        p               0.3;
    }
}

fieldBounds
{
    // With bounding
    p      5e4     2e5;
    T      230     380;
    U      400;
}

// ************************************************************************* //
